# parameters
nc: 2 # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, ECAM, [64,64]],
   [-3, 1, Conv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [[-1,-3], 1, Concat, [1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -4, -5,-6, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8



   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, ECAM, [ 128,128 ] ],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, DWConv, [128, 3, 1]],
   [-1, 1, DWConv, [128, 3, 1]],
   [[-1,-3], 1, Concat, [1]],
   [-1, 1, DWConv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -4, -5, -6, -7], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 24
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16



   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, ECAM, [ 256,256 ] ],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, DWConv, [256, 3, 1]],
   [-1, 1, DWConv, [256, 3, 1]],
   [[-1,-3], 1, Concat, [1]],
   [-1, 1, DWConv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -4, -5, -6, -7], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 37
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32


   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, ECAM, [ 256,256 ] ],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, DWConv, [256, 3, 1]],
   [-1, 1, DWConv, [256, 3, 1]],
   [[-1,-3], 1, Concat, [1]],
   [-1, 1, DWConv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -4, -5,-6, -7], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 50
  ]

# yolov7 headM
head:
  [[-1, 1,SPPCSPC, [512]], # 51+8=59

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [43, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],


   [-1, 1,FPC,[256,256,128,1]],

   [-1, 1, Conv, [256, 1, 1]], # 65

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [28, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],#69

   [-1, 1,FPC,[256,256,128,1]],#70

   [-1, 1, Conv, [128, 1, 1]], #71

   [-1, 1, MP, []],#72
   [-1, 1, Conv, [128, 1, 1]],#73
   [-3, 1, Conv, [128, 1, 1]],#74
   [-1, 1, Conv, [128, 3, 2]],#76
   [[-1, -4,65], 1, Concat, [1]],#77

   [-1, 1,FPC,[512,512, 256, 1]],#78
   [-1, 1, Conv, [256, 1, 1]], # 79

   [-1, 1, MP, []],#80
   [-1, 1, Conv, [256, 1, 1]],#81
   [-3, 1, Conv, [256, 1, 1]],#82
   [-1, 1, Conv, [256, 3, 2]],#84
   [[-1, -4,59], 1, Concat, [1]],#85

   [-1, 1,FPC,[512,512,256,1]],#86
   [-1, 1, Conv, [512, 1, 1]],#87

   [71, 1, FT_Conv_Concat, [128]],
   [-1, 1,CoordConv, [128, 3, 1]],
   [78, 1, FT_Conv_Concat, [256]],
   [-1, 1, CoordConv, [256, 3, 1]],
   [85, 1, FT_Conv_Concat, [512]],
   [-1, 1, CoordConv, [512, 3, 1]],

   [[-5,-3,-1], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
